/*
  항해플러스- 코딩테스트 쉽게 접근하자, 허재 코치님 
  취업필수조건 : CS지식, 프레임워크, 코딩테스트...!!(5년전 등장)
  1 자료구조
  2 알고리즘 : 정렬, 구현, 탐색, (수학, DP)

  자료구조를 기반으로 적절한 알고리즘(5가지로 핵심을 요약할 수 있음)을 사용하는 것입니다. 
  5~7문제가 등장합니다. 정렬, 구현, 탐색이 중점을 이뤄집니다. 

  - 자료구조
    - 단순(원시형)
    - 복합(선형(배열, 링크드 리스트, 스택, 큐, 힙), 비선형(트리, 그래프 - 자료간의 연관관계))
    - 심화 : 리스트(링크드, 더블링크드, 환형), 스택(배열기반), 큐(환형, 링크드), 트리(이진트리), 그래프(단방향, 양방향), 힙
    - 고급 : 트라이, 레드 블랙 트리 

  - 왜 Python 으로 봐라?
    - 코딩테스트는 적절한 알고리즘을 활용할 수 있어야 하는데, Python, Java는 내장 함수가 있지만, JS는 필요에 따라 직접 구현해야 됨   
  
  - 알고리즘 비율
    - 구현 33% : 수능 비문학적인 측면이 있습니다. 
    - DFS, BFS 20% : 완전탐색
    - 그리디 19%  
    - 정렬, 다이나믹 프로그래밍  8.2%
    - 이진탐색 3.8%

  - 필수 알고리즘과 트랜드 
    - 필수
      - 완전탐색
      - 이분탐색, 투포인터, 슬라이딩 윈도우(구간탐색)
      - 누적합(구간 내의 합 구하기)  
      - 유클리드(최소공배수, 최대공약수) : 기본
      - 에라토스테네스의 체(소수 빠르게 구하기) : 기본 : timeout 
    - 선택
      - 최단거리 구하기(다익스트라)
      - 유니온파인드(같은 그룹인지 확인) 
      - Monotonic Stack, Bitmask   
*/

/* DFS, BFS 문제풀이 : Queue를 사용해야 합니다.*/ 

